
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"506e038efc20a9f79de6d3f8c0bde6135b43ca2b54d757df23254d0219c506c6\"" -> "W/\"ea4fd41fb9a3c8cc46a60a0ff1d5f198fe60acae05b5931562f60bbb9a0b84ff\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"2d245aa2b5f35839580beed0edf52a20f38c6e6195466fd3de09223e5422d960\"" -> "W/\"c815dacd0fc183c3efd48f380273810a7bc50309e3394843f51c827cd364221e\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"3547d8dfb76de2ce3bd2fa0eab354ce4426f347bc780b0f83707277f2504caa1\"" -> "W/\"e5d2db1043dfd064f69414865d36ce0c824dc424f25c2820f41e1d4840778c9a\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"d4414dbb9283963ffaac8fcfdf5c72ff2cbe4c8464b9e89c315d8e92a38d2525\"" -> "W/\"90a831f19cff6743b5611f6463080232fce8c5e71d3b88395b11a07a5fd6456a\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"9ea3125dc1d5613874185294e4c3bcda2c1cc70b34c26012bb887e956f80c2cb\"" -> "W/\"7d53cb1838506d344b87ea2339acab39ecc555b42e27a79a6600ca2a1f6da5a0\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"c0cdb3b855afc90f73ab0509b5778fcbaaf834607257f3bf0d788eb505f52322\"" -> "W/\"b4a06a16d36b3e41a8bed741cb7c9b37f93e850c8676a4b121ba4db128e33ec9\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"9e6892048e9e1fb8cfb6d8787a72b0e167b2773549c8d219f2f1b51351013714\"" -> "W/\"a727934c1e2745dcf403f988cf63cf4399ebc85fea9e3ccf7e6dcd6bf0b380fb\""
        id                          = "template-template"
        name                        = "template-template"
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"3422e6ea20229ed7c7344ebbb51c886737728fef549dd417ae3495906b12dd7e\"" -> "W/\"b7931895f0324c87cd0f1de03bd98d9a9b15de4917502db4222a70e16359eaed\""
        id          = "1430801"
        name        = "protect-main-branch-atc-router-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"98b0163b5636fefe246c10d90e880c81f106acc290850fb43eb560f0945be2d1\"" -> "W/\"7ee93815af079017648794b76c25da9c8bea55deb23cebffc6ffe458e33182d3\""
        id          = "1430804"
        name        = "protect-main-branch-kong-build-images-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"9d41e034a0e1d8a74a8ae2c58725a066f2ac00fc8f3eaf0ec7b0126e3f325345\"" -> "W/\"be5eafa79cad4f7554cf6db204a11ca8d43fc4e58d3706d69ebef23aa88773fd\""
        id          = "1430806"
        name        = "protect-main-branch-kong-development-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"ec7789d0f1906b7c1be0f6a504fe17ba8312a44bcfe8915f7bd76ddead1bc335\"" -> "W/\"b932c00086238de772d80493e9be073d59888fcdd1cd1573377ad1fbb805b440\""
        id          = "1430805"
        name        = "protect-main-branch-kong-openssl-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"6ace168832e23f08c43e2123eb9f13ecb88be2dfa0ba739133376fd6d2da6d73\"" -> "W/\"951686d8f18dc15f4cf2200f34dbec1b8d98a3b68f78ad3f366996cf18905fa3\""
        id          = "1430802"
        name        = "protect-main-branch-kong-package-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"c82bc41a6a44add051d86a46553043acb517a37624e87e954726d40598629509\"" -> "W/\"39fd408115fd526f032ac4a6b2c1c523da6a1a0fe20d1ec096735ab3f86b6b46\""
        id          = "1430818"
        name        = "protect-main-branch-kong-runtime-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"0142b65db9bef4a89df9826ad2bdd7dcc08a29b7747d8b07120870db72890b86\"" -> "W/\"323d8ff16e8b65aac5ff0b632bff67497d118d9cc38fdd7aa8df9cca3f3f9d99\""
        id          = "1430817"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"8d757f3e10cbc7b0f335a39f64f93fa98029cccea89628b15e6b89d85934c42d\"" -> "W/\"12ef90b710df5a4e433a1ebfdb2ee049229361627b6935a646d40ff556bd40bd\""
        id          = "1430803"
        name        = "protect-main-branch-template-1-github-release-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"72e6fe0c85f005619c9794104aeba5392e3bd7e069143e78e13f1de64e825e5c\"" -> "W/\"3061b82c6467e500c551ae87e5a6fb555d4f76cebc8d647c072e40e06befd19f\""
        id          = "1430814"
        name        = "protect-main-branch-template-1-terraform-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"e17fc0cc935f82b58b3f2a5ecfdead4f8a65cf433e41d1e8e052100828b55d7c\"" -> "W/\"db46f25686fa48a52aa5a9f0594dc239e06728b214b0f096e28e22b1eb2fbad8\""
        id          = "1430815"
        name        = "protect-main-branch-template-template-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"ec6b48a10d748b763df0b5fe513d88d64f875d3f24492d35075f8936f01b9e85\"" -> "W/\"146835948de1e2278851d58af84b99379de3a73df054b943c4efdcb9ccd1a3ec\""
        id          = "1430807"
        name        = "protect-main-branch-terraform-github-pre-commit-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"0272f6350040254a5e7a500921a4950ed6ba6a27c705a872a5e14a046a2329f1\"" -> "W/\"d2fed43c708929080b4bc18c49c407c9bf9b77450ec28b3eb3eff3c61a43002e\""
        id          = "1430869"
        name        = "protect-main-branch-kong-build-images-release-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"184754c2341801b7a1d216f5ac0fb54c8d0bb0b5162b373b418b52f66386d16d\"" -> "W/\"becab11bc119c8ca9fa9d059a3b7228e6ffb66b8e145bf669032604a16af8091\""
        id          = "1430871"
        name        = "protect-main-branch-kong-development-release-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"a9a490e5907a070fc5ab8a0197e0d8e3a468e0aac384b4afcda564f0e79e8c74\"" -> "W/\"ba9c13c6e03dcebe1b4bf3fd2c35fb738b9460061537428d28e7537cc77d2c7b\""
        id          = "1430870"
        name        = "protect-main-branch-kong-openssl-release-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"174bf64aecef8ea107eb3ea85f696462cefdd1160d37af1dfd7996fabd1a8f5c\"" -> "W/\"28ac0ef8c2a06dbe0b3f2fd0c6474345f764f5999e5c515c477fc61846481e89\""
        id          = "1430873"
        name        = "protect-main-branch-kong-package-release-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"b80bfb2e2c7795ac873b45440f62c7790973174f3b2b2e918a448fefa417f302\"" -> "W/\"7965ad6b15a690bb4e83ec3ec10feff5a8c7d88d3ae572527322d8ca1f5cddd6\""
        id          = "1430868"
        name        = "protect-main-branch-kong-runtime-release-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"9e4c252b8adcffc91ae47f9451a5f9a0a2b8703a916661e0210ea4d88093c2d2\"" -> "W/\"7ca0664028a73394481d99e34d6d024ab967bf540706856c47a12d37b8c72e15\""
        id          = "1430872"
        name        = "protect-main-branch-multi-arch-fpm-release-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"6dbcd0b74b5254de26accffb1fbfb6fb411e208b8b47d0eed777df093722321d\"" -> "W/\"7cbbead2ff15160589d3c14f1f88900f35b981106b229da0eaa28d6d092b7f26\""
        id          = "1430865"
        name        = "protect-main-branch-template-1-terraform-terraform-plan-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"29e5e2f56927e5c1a445f9aaad8a6fa03eda4869a8b299ff4aeac9ddc97b9710\"" -> "W/\"6d3e1e68316e77d738ca58f5d98037545f2b318945bcb878d91ce3eba6dc3262\""
        id          = "1430864"
        name        = "protect-main-branch-terraform-github-terraform-plan-20240816-070851"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430801"
      ~ name        = "protect-main-branch-atc-router-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430804"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430806"
      ~ name        = "protect-main-branch-kong-development-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430805"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430802"
      ~ name        = "protect-main-branch-kong-package-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430818"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430817"
      ~ name        = "protect-main-branch-multi-arch-fpm-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430803"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430814"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430815"
      ~ name        = "protect-main-branch-template-template-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1430807"
      ~ name        = "protect-main-branch-terraform-github-pre-commit-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430869"
      ~ name        = "protect-main-branch-kong-build-images-release-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430871"
      ~ name        = "protect-main-branch-kong-development-release-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430870"
      ~ name        = "protect-main-branch-kong-openssl-release-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430873"
      ~ name        = "protect-main-branch-kong-package-release-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430868"
      ~ name        = "protect-main-branch-kong-runtime-release-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1430872"
      ~ name        = "protect-main-branch-multi-arch-fpm-release-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["template-1-github-release"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "template-1-github-release"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430865"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1430864"
      ~ name        = "protect-main-branch-terraform-github-terraform-plan-20240816-070851" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 19 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->